In [1]:
## PANDAS BASICS VI (Merging inner ,outer,left, right,inditicator)
## Pivot , Pivot_table

In [2]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [4]:
## Merging based on city
df3=pd.merge(df1,df2,on='city')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
# Types Of JOIN

In [6]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [7]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [8]:
## Inner Join
df3=pd.merge(df1,df2,on='city',how='inner')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [9]:
## Left Join
df4=pd.merge(df1,df2,on='city',how='left')
df4

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [10]:
## outer join
df4=pd.merge(df1,df2,on='city',how='outer')
df4

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [11]:
## right join
df5=pd.merge(df1,df2,on='city',how='right')
df5

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

In [12]:
df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

In [13]:
## Joining two DataFrame Based on Index

In [18]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [19]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando","texas"],
    "humidity": [65,68,75,80],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75
texas           80

In [20]:
df1.join(df2)  ## Joining Based on INdex

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

In [21]:
# PIVOT TABLE

In [22]:
import pandas as pd
df1=pd.read_csv('weather.csv')
df1

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [23]:
df2=df1.pivot(index='date',columns='city',values='temperature')

In [24]:
df2

city      beijing  mumbai  new york
date
5/1/2017       80      75        65
5/2/2017       77      78        66
5/3/2017       79      82        68

In [26]:
import numpy as np
df3=df1.pivot_table(index="city",columns="date",values='temperature', margins=True,aggfunc=np.sum)
## row wise and column wise addition

In [27]:
df3

date      5/1/2017  5/2/2017  5/3/2017  All
city
beijing         80        77        79  236
mumbai          75        78        82  235
new york        65        66        68  199
All            220       221       229  670